nxp-appcodehub/an-pmsm-foc-mcxa153/board/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitBUTTONsPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitBUTTONsPins(void)
{
#if 1
    const port_pin_config_t port1_7_pinD3_config = {/* Internal pull-up/down resistor is disabled */
                                                     kPORT_PullDisable,
                                                     /* Low internal pull resistor value is selected. */
                                                     kPORT_LowPullResistor,
                                                     /* Fast slew rate is configured */
                                                     kPORT_FastSlewRate,
                                                     /* Passive input filter is disabled */
                                                     kPORT_PassiveFilterDisable,
                                                     /* Open drain output is disabled */
                                                     kPORT_OpenDrainDisable,
                                                     /* Low drive strength is configured */
                                                     kPORT_LowDriveStrength,
                                                     /* Normal drive strength is configured */
                                                     kPORT_NormalDriveStrength,
                                                     /* Pin is configured as P3_29 */
                                                     kPORT_MuxAlt0,
                                                     /* Digital input enabled */
                                                     kPORT_InputBufferEnable,
                                                     /* Digital input is not inverted */
                                                     kPORT_InputNormal,
                                                     /* Pin Control Register fields [15:0] are not locked */
                                                     kPORT_UnlockRegister};
    /* PORT1_11 (pin D3) is configured as PIO1_11 */
    PORT_SetPinConfig(PORT1, 7U, &port1_7_pinD3_config);
#else
    PORT1->PCR[7] = 0x00000003;
#endif      
    GPIO1->ICR[7] = 0x000A0000;
    GPIO1->PDDR &= (~(1UL << 7U));   
    
    NVIC_EnableIRQ(GPIO1_IRQn);

    //NVIC_SetPriority(GPIO1_IRQn, 4);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPWM:
- options: {callFromInitBoot: 'true', coreID: cm33_core0, enableClock: 'true'}
- pin_list:
  - {pin_num: K2, peripheral: PWM1, signal: 'A, 0', pin_signal: PIO2_6/TRIG_IN4/FC9_P4/SDHC0_D3/SCT0_OUT4/PWM1_A0/FLEXIO0_D14/FLEXSPI0_B_DATA2/SINC0_MCLK2/SAI0_TX_BCLK}
  - {pin_num: L2, peripheral: PWM1, signal: 'B, 0', pin_signal: PIO2_7/TRIG_IN5/FC9_P5/SDHC0_D2/SCT0_OUT5/PWM1_B0/FLEXIO0_D15/FLEXSPI0_B_DATA3/SINC0_MBIT2/SAI0_TX_FS}
  - {pin_num: K3, peripheral: PWM1, signal: 'A, 1', pin_signal: PIO2_4/WUU0_IN17/FC9_P0/SDHC0_CLK/SCT0_OUT2/PWM1_A1/FLEXIO0_D12/FLEXSPI0_B_DATA0/SINC0_MCLK1/SAI0_RXD1}
  - {pin_num: K1, peripheral: PWM1, signal: 'B, 1', pin_signal: PIO2_5/TRIG_OUT3/FC9_P2/SDHC0_CMD/SCT0_OUT3/PWM1_B1/FLEXIO0_D13/FLEXSPI0_B_DATA1/SINC0_MBIT1/SAI0_TXD1}
  - {pin_num: H3, peripheral: PWM1, signal: 'A, 2', pin_signal: PIO2_2/WUU0_IN16/CLKOUT/FC9_P3/SDHC0_D1/SCT0_OUT0/PWM1_A2/FLEXIO0_D10/FLEXSPI0_B_SS0_b/SINC0_MCLK0/SAI0_TXD0}
  - {pin_num: J3, peripheral: PWM1, signal: 'B, 2', pin_signal: PIO2_3/FC9_P1/SDHC0_D0/SCT0_OUT1/PWM1_B2/FLEXIO0_D11/FLEXSPI0_B_SCLK/SINC0_MBIT0/SAI0_RXD0}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPWM
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitPWM(void)
{
    /* PORT2_2 (pin H3) is configured as PWM1_A2 */
    PORT_SetPinMux(PORT3, 6U, kPORT_MuxAlt5);

    PORT3->PCR[6] = ((PORT3->PCR[6] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_IBE_MASK)))

                     /* Input Buffer Enable: Enables. */
                     | PORT_PCR_IBE(PCR_IBE_ibe1));
    
    uint32_t port_pin_config_PWM
      = kPORT_PullDisable       <<PORT_PCR_PS_SHIFT/* Internal pull-up/down resistor is disabled */
      | kPORT_FastSlewRate      <<PORT_PCR_SRE_SHIFT/* Fast slew rate is configured */
      | kPORT_OpenDrainDisable  <<PORT_PCR_ODE_SHIFT/* Open drain output is disabled */
      | kPORT_LowDriveStrength  <<PORT_PCR_DSE_SHIFT/* Low drive strength is configured */
      | kPORT_MuxAlt5           <<PORT_PCR_MUX_SHIFT/* Pin is configured as PIO1_11 */
      | kPORT_InputBufferEnable <<PORT_PCR_IBE_SHIFT/* Digital input enabled */
      | kPORT_InputNormal       <<PORT_PCR_INV_SHIFT/* Digital input is not inverted */
      | kPORT_UnlockRegister    <<PORT_PCR_LK_SHIFT;/* Pin Control Register fields [15:0] are not locked */
  
    PORT3->PCR[6]       = port_pin_config_PWM;
    PORT3->PCR[7]       = port_pin_config_PWM;
    PORT3->PCR[8]       = port_pin_config_PWM;
    PORT3->PCR[9]       = port_pin_config_PWM;
    PORT3->PCR[10]      = port_pin_config_PWM;
    PORT3->PCR[11]      = port_pin_config_PWM;
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitADC:
- options: {callFromInitBoot: 'true', coreID: cm33_core0, enableClock: 'true'}
- pin_list:
  - {pin_num: T3, peripheral: ADC1, signal: 'B, 0', pin_signal: ADC1_B0}
  - {pin_num: M10, peripheral: ADC1, signal: 'B, 10', pin_signal: PIO5_2/VBAT_WAKEUP_b/SPC_LPREQ/TAMPER0/ADC1_B10}
  - {pin_num: N11, peripheral: ADC1, signal: 'B, 11', pin_signal: PIO5_3/TRIG_IN11/RTC_CLKOUT/TAMPER1/ADC1_B11}
  - {pin_num: M12, peripheral: ADC1, signal: 'B, 12', pin_signal: PIO5_4/TRIG_OUT7/SPC_LPREQ/TAMPER2/ADC1_B12}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

